# **pymysql을 이용한 MariaDB 연동**
### connect() 함수를 이용하면 MySQL host내 DB와 직접 연결할 수 있다.

###    user: user name
###    passwd: 설정한 패스워드
###    host: DB가 존재하는 host
###    db: 연결할 데이터베이스 이름
###    charset: 인코딩 설정

In [1]:
import pymysql
conn = pymysql.connect(host='multi-bigdata.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu12',passwd='edu12', db='unicodb')
print(conn)

<pymysql.connections.Connection object at 0x000001FB6460E848>

In [2]:
import pymysql
conn = pymysql.connect(host='multi-bigdata.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu12',passwd='edu12', db='unicodb')
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row[0]} {row[1]} {row[2]} {row[3]} {row[4]} {row[5]} {row[6]} {row[7]}')
finally:
    conn.close()

<class 'pymysql.cursors.Cursor'>
-----------------------
<class 'tuple'>
(('7369', 'SMITH', 'CLERK', '7902', datetime.date(1980, 12, 17), 800, None, '20'), ('7499', 'ALLEN', 'SALESMAN', '7698', datetime.date(1981, 2, 20), 1600, 300, '30'), ('7521', 'WARD', 'SALESMAN', '7698', datetime.date(1981, 2, 3), 1250, 500, '30'), ('7566', 'JONES', 'MANAGER', '7839', datetime.date(1981, 3, 2), 2975, None, '20'), ('7654', 'MARTIN', 'SALESMAN', '7698', datetime.date(1981, 10, 22), 1250, 1400, '30'), ('7698', 'BLAKE', 'MANAGER', '7839', datetime.date(1981, 5, 1), 2850, None, '30'), ('7782', 'CLARK', 'MANAGER', '7839', datetime.date(1981, 9, 6), 2450, None, '10'), ('7788', 'SCOTT', 'ANALYST', '7566', datetime.date(1982, 12, 8), 3000, None, '20'), ('7839', 'KING', 'PRESIDENT', None, datetime.date(1981, 11, 17), 5000, None, '10'), ('7844', 'TURNER', 'SALESMAN', '7698', datetime.date(1984, 10, 8), 1500, None, '30'), ('7876', 'ADAMS', 'CLERK', '7788', datetime.date(1983, 1, 12), 1100, None, '20'), ('7900', 'JAMES', 'CLERK', '7698', datetime.date(1981, 12, 3), 950, None, '30'), ('7902', 'FORD', 'ANALYST', '7566', datetime.date(1981, 12, 13), 3000, None, '20'), ('7788', 'SCOTT', 'ANALYST', '7566', datetime.date(1987, 4, 19), 3000, None, '20'), ('7876', 'DOOLY', 'CLERK', None, datetime.date(1987, 5, 23), 1100, None, None), ('7934', 'DUKE', 'CLERK', '7782', datetime.date(1982, 1, 25), 1300, None, '10'))
----------------------------------------------
<class 'tuple'>
('7369', 'SMITH', 'CLERK', '7902', datetime.date(1980, 12, 17), 800, None, '20')
----------------------------------------------
16
8
----------------------------------------------
7369 SMITH CLERK 7902 1980-12-17 800 None 20
7499 ALLEN SALESMAN 7698 1981-02-20 1600 300 30
7521 WARD SALESMAN 7698 1981-02-03 1250 500 30
7566 JONES MANAGER 7839 1981-03-02 2975 None 20
7654 MARTIN SALESMAN 7698 1981-10-22 1250 1400 30
7698 BLAKE MANAGER 7839 1981-05-01 2850 None 30
7782 CLARK MANAGER 7839 1981-09-06 2450 None 10
7788 SCOTT ANALYST 7566 1982-12-08 3000 None 20
7839 KING PRESIDENT None 1981-11-17 5000 None 10
7844 TURNER SALESMAN 7698 1984-10-08 1500 None 30
7876 ADAMS CLERK 7788 1983-01-12 1100 None 20
7900 JAMES CLERK 7698 1981-12-03 950 None 30
7902 FORD ANALYST 7566 1981-12-13 3000 None 20
7788 SCOTT ANALYST 7566 1987-04-19 3000 None 20
7876 DOOLY CLERK None 1987-05-23 1100 None None
7934 DUKE CLERK 7782 1982-01-25 1300 None 10

## Cursor 객체 생성
### 연결한 DB와 상호작용하기 위해 cursor 객체를 생성해주어야 한다.
### 다양한 커서의 종류가 있지만,
### 데이터 분석가에게 익숙한 데이터프레임 형태로 결과를 쉽게 변환할 수 있도록
### **딕셔너리** 형태로 결과를 반환해주는 **DictCursor**객체를 주로 사용한다.
### 일반 **Cursor**객체를 사용하면 결과가 일반적으로는 **튜플** 형태로 리턴된다.
----
### SELECT 명령을 위해 SQL 문을 따로 변수에 넣어주고 cursor.execute(sql) 을 사용해 SQL를 실행한다.
### 실행한 결과를 fetchall(), fetchone() 등으로 받아 온다.

### **fetchall()** - 모든 데이터를 한 번에 가져올 때 사용
### **fetchone()** - 한 번 호출에 하나의 행만 가져올 때 사용
### **fetchmany(n)** - n개만큼의 데이터를 가져올 때 사용

In [3]:
import pymysql
conn = pymysql.connect(host='multi-bigdata.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu12',passwd='edu12', db='unicodb', cursorclass=pymysql.cursors.DictCursor)
try:
    cur = conn.cursor()
    print(type(cur))
    print("-----------------------")
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(type(result))
    print(result)
    print("----------------------------------------------")
    print(type(result[0]))
    print(result[0])
    print("----------------------------------------------")
    print(len(result))
    print(len(result[0]))
    print("----------------------------------------------")
    for row in result:        
        print(f'{row["empno"]} {row["ename"]} {row["job"]} {row["mgr"]} {row["hiredate"]} {row["sal"]} {row["comm"]} {row["deptno"]}')
finally:
    conn.close()

<class 'pymysql.cursors.DictCursor'>
-----------------------
<class 'list'>
[{'empno': '7369', 'ename': 'SMITH', 'job': 'CLERK', 'mgr': '7902', 'hiredate': datetime.date(1980, 12, 17), 'sal': 800, 'comm': None, 'deptno': '20'}, {'empno': '7499', 'ename': 'ALLEN', 'job': 'SALESMAN', 'mgr': '7698', 'hiredate': datetime.date(1981, 2, 20), 'sal': 1600, 'comm': 300, 'deptno': '30'}, {'empno': '7521', 'ename': 'WARD', 'job': 'SALESMAN', 'mgr': '7698', 'hiredate': datetime.date(1981, 2, 3), 'sal': 1250, 'comm': 500, 'deptno': '30'}, {'empno': '7566', 'ename': 'JONES', 'job': 'MANAGER', 'mgr': '7839', 'hiredate': datetime.date(1981, 3, 2), 'sal': 2975, 'comm': None, 'deptno': '20'}, {'empno': '7654', 'ename': 'MARTIN', 'job': 'SALESMAN', 'mgr': '7698', 'hiredate': datetime.date(1981, 10, 22), 'sal': 1250, 'comm': 1400, 'deptno': '30'}, {'empno': '7698', 'ename': 'BLAKE', 'job': 'MANAGER', 'mgr': '7839', 'hiredate': datetime.date(1981, 5, 1), 'sal': 2850, 'comm': None, 'deptno': '30'}, {'empno': '7782', 'ename': 'CLARK', 'job': 'MANAGER', 'mgr': '7839', 'hiredate': datetime.date(1981, 9, 6), 'sal': 2450, 'comm': None, 'deptno': '10'}, {'empno': '7788', 'ename': 'SCOTT', 'job': 'ANALYST', 'mgr': '7566', 'hiredate': datetime.date(1982, 12, 8), 'sal': 3000, 'comm': None, 'deptno': '20'}, {'empno': '7839', 'ename': 'KING', 'job': 'PRESIDENT', 'mgr': None, 'hiredate': datetime.date(1981, 11, 17), 'sal': 5000, 'comm': None, 'deptno': '10'}, {'empno': '7844', 'ename': 'TURNER', 'job': 'SALESMAN', 'mgr': '7698', 'hiredate': datetime.date(1984, 10, 8), 'sal': 1500, 'comm': None, 'deptno': '30'}, {'empno': '7876', 'ename': 'ADAMS', 'job': 'CLERK', 'mgr': '7788', 'hiredate': datetime.date(1983, 1, 12), 'sal': 1100, 'comm': None, 'deptno': '20'}, {'empno': '7900', 'ename': 'JAMES', 'job': 'CLERK', 'mgr': '7698', 'hiredate': datetime.date(1981, 12, 3), 'sal': 950, 'comm': None, 'deptno': '30'}, {'empno': '7902', 'ename': 'FORD', 'job': 'ANALYST', 'mgr': '7566', 'hiredate': datetime.date(1981, 12, 13), 'sal': 3000, 'comm': None, 'deptno': '20'}, {'empno': '7788', 'ename': 'SCOTT', 'job': 'ANALYST', 'mgr': '7566', 'hiredate': datetime.date(1987, 4, 19), 'sal': 3000, 'comm': None, 'deptno': '20'}, {'empno': '7876', 'ename': 'DOOLY', 'job': 'CLERK', 'mgr': None, 'hiredate': datetime.date(1987, 5, 23), 'sal': 1100, 'comm': None, 'deptno': None}, {'empno': '7934', 'ename': 'DUKE', 'job': 'CLERK', 'mgr': '7782', 'hiredate': datetime.date(1982, 1, 25), 'sal': 1300, 'comm': None, 'deptno': '10'}]
----------------------------------------------
<class 'dict'>
{'empno': '7369', 'ename': 'SMITH', 'job': 'CLERK', 'mgr': '7902', 'hiredate': datetime.date(1980, 12, 17), 'sal': 800, 'comm': None, 'deptno': '20'}
----------------------------------------------
16
8
----------------------------------------------
7369 SMITH CLERK 7902 1980-12-17 800 None 20
7499 ALLEN SALESMAN 7698 1981-02-20 1600 300 30
7521 WARD SALESMAN 7698 1981-02-03 1250 500 30
7566 JONES MANAGER 7839 1981-03-02 2975 None 20
7654 MARTIN SALESMAN 7698 1981-10-22 1250 1400 30
7698 BLAKE MANAGER 7839 1981-05-01 2850 None 30
7782 CLARK MANAGER 7839 1981-09-06 2450 None 10
7788 SCOTT ANALYST 7566 1982-12-08 3000 None 20
7839 KING PRESIDENT None 1981-11-17 5000 None 10
7844 TURNER SALESMAN 7698 1984-10-08 1500 None 30
7876 ADAMS CLERK 7788 1983-01-12 1100 None 20
7900 JAMES CLERK 7698 1981-12-03 950 None 30
7902 FORD ANALYST 7566 1981-12-13 3000 None 20
7788 SCOTT ANALYST 7566 1987-04-19 3000 None 20
7876 DOOLY CLERK None 1987-05-23 1100 None None
7934 DUKE CLERK 7782 1982-01-25 1300 None 10

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(result)
df

   empno   ename        job   mgr    hiredate   sal    comm deptno
0   7369   SMITH      CLERK  7902  1980-12-17   800     NaN     20
1   7499   ALLEN   SALESMAN  7698  1981-02-20  1600   300.0     30
2   7521    WARD   SALESMAN  7698  1981-02-03  1250   500.0     30
3   7566   JONES    MANAGER  7839  1981-03-02  2975     NaN     20
4   7654  MARTIN   SALESMAN  7698  1981-10-22  1250  1400.0     30
5   7698   BLAKE    MANAGER  7839  1981-05-01  2850     NaN     30
6   7782   CLARK    MANAGER  7839  1981-09-06  2450     NaN     10
7   7788   SCOTT    ANALYST  7566  1982-12-08  3000     NaN     20
8   7839    KING  PRESIDENT  None  1981-11-17  5000     NaN     10
9   7844  TURNER   SALESMAN  7698  1984-10-08  1500     NaN     30
10  7876   ADAMS      CLERK  7788  1983-01-12  1100     NaN     20
11  7900   JAMES      CLERK  7698  1981-12-03   950     NaN     30
12  7902    FORD    ANALYST  7566  1981-12-13  3000     NaN     20
13  7788   SCOTT    ANALYST  7566  1987-04-19  3000     NaN     20
14  7876   DOOLY      CLERK  None  1987-05-23  1100     NaN   None
15  7934    DUKE      CLERK  7782  1982-01-25  1300     NaN     10

In [7]:
import pymysql

dbServerName    	= "multi-bigdata.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com"
dbUser          	= "edu12"
dbPassword      	= "edu12"
dbName          	= "edudb04"
charSet         	= "utf8"
cusrorType      	= pymysql.cursors.DictCursor

connectionObject   = pymysql.connect(host=dbServerName, user=dbUser, password=dbPassword,
                                     db=dbName, charset=charSet,cursorclass=cusrorType)

try:
    cursorObject = connectionObject.cursor()                                     
    sqlQuery = "CREATE TABLE IF NOT EXISTS Employee(id int, LastName varchar(32), FirstName varchar(32), DepartmentCode int)"   
    cursorObject.execute(sqlQuery)
    sqlQuery = "show tables"   
    cursorObject.execute(sqlQuery)
    rows = cursorObject.fetchall()
    for row in rows:
        print(row)

    insertStatement = "INSERT INTO Employee (id, LastName, FirstName, DepartmentCode) VALUES (1,'KIM','JUNGHYUN',10)"   
    cursorObject.execute(insertStatement)
    insertStatement = "INSERT INTO Employee (id, LastName, FirstName, DepartmentCode) VALUES (1,'GO','GILDONG',10)"   
    cursorObject.execute(insertStatement)
    connectionObject.commit()

    sqlQuery = "select * from Employee"   
    cursorObject.execute(sqlQuery)
    rows = cursorObject.fetchall()

    for row in rows:
        print(row)

except Exception as e:
    print("Exeception occured:{}".format(e))
finally:    
    connectionObject.close()

{'Tables_in_edudb04': 'Employee'}
{'id': 1, 'LastName': 'KIM', 'FirstName': 'JUNGHYUN', 'DepartmentCode': 10}
{'id': 1, 'LastName': 'GO', 'FirstName': 'GILDONG', 'DepartmentCode': 10}
{'id': 1, 'LastName': 'KIM', 'FirstName': 'JUNGHYUN', 'DepartmentCode': 10}
{'id': 1, 'LastName': 'GO', 'FirstName': 'GILDONG', 'DepartmentCode': 10}
{'id': 1, 'LastName': 'KIM', 'FirstName': 'JUNGHYUN', 'DepartmentCode': 10}
{'id': 1, 'LastName': 'GO', 'FirstName': 'GILDONG', 'DepartmentCode': 10}

In [8]:
import pymysql
conn = pymysql.connect(host='multi-bigdata.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu12',passwd='edu12', db='unicodb')
try:
    cur = conn.cursor()
    sql = 'SELECT * FROM emp'
    cur.execute(sql)
    result = cur.fetchall()
    print(result)
    print("----------------------------------------------")
    sql = 'SELECT * FROM dept'
    cur.execute(sql)
    result = cur.fetchall()
    print(result)
    print("----------------------------------------------")
    sql = 'SELECT * FROM edudb.Employee'
    cur.execute(sql)
    result = cur.fetchall()
    print(result)   
finally:
    conn.close()

(('7369', 'SMITH', 'CLERK', '7902', datetime.date(1980, 12, 17), 800, None, '20'), ('7499', 'ALLEN', 'SALESMAN', '7698', datetime.date(1981, 2, 20), 1600, 300, '30'), ('7521', 'WARD', 'SALESMAN', '7698', datetime.date(1981, 2, 3), 1250, 500, '30'), ('7566', 'JONES', 'MANAGER', '7839', datetime.date(1981, 3, 2), 2975, None, '20'), ('7654', 'MARTIN', 'SALESMAN', '7698', datetime.date(1981, 10, 22), 1250, 1400, '30'), ('7698', 'BLAKE', 'MANAGER', '7839', datetime.date(1981, 5, 1), 2850, None, '30'), ('7782', 'CLARK', 'MANAGER', '7839', datetime.date(1981, 9, 6), 2450, None, '10'), ('7788', 'SCOTT', 'ANALYST', '7566', datetime.date(1982, 12, 8), 3000, None, '20'), ('7839', 'KING', 'PRESIDENT', None, datetime.date(1981, 11, 17), 5000, None, '10'), ('7844', 'TURNER', 'SALESMAN', '7698', datetime.date(1984, 10, 8), 1500, None, '30'), ('7876', 'ADAMS', 'CLERK', '7788', datetime.date(1983, 1, 12), 1100, None, '20'), ('7900', 'JAMES', 'CLERK', '7698', datetime.date(1981, 12, 3), 950, None, '30'), ('7902', 'FORD', 'ANALYST', '7566', datetime.date(1981, 12, 13), 3000, None, '20'), ('7788', 'SCOTT', 'ANALYST', '7566', datetime.date(1987, 4, 19), 3000, None, '20'), ('7876', 'DOOLY', 'CLERK', None, datetime.date(1987, 5, 23), 1100, None, None), ('7934', 'DUKE', 'CLERK', '7782', datetime.date(1982, 1, 25), 1300, None, '10'))
----------------------------------------------
(('10', 'ACCOUNTING', 'NEW YORK'), ('20', 'REARCH', 'DALLAS'), ('30', 'SALES', 'CHICAGO'), ('40', 'OPERATIONS', 'BOSTON'))
----------------------------------------------
((1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10), (1, 'KIM', 'JUNGHYUN', 10), (1, 'GO', 'GILDONG', 10))

In [9]:
# 교재 224 페이지 예제 시작
import pymysql
conn = pymysql.connect(host='multi-bigdata.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu12',passwd='edu12', db='edudb')

cur = conn.cursor()
sql = 'SELECT * FROM dataset4'
cur.execute(sql)
result = cur.fetchone()
print(result)

(2, 1.0, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C', 90, 'Cumings, Mrs. Florence Briggs (née Thayer)', 35, 'New York, New York, US', 'Cherbourg', 'New York, New York, US', '4', '', 1)

In [ ]:
#sql = 'SELECT * FROM dataset4'
#cur.execute(sql)
alldata = cur.fetchall()
print(alldata)

In [ ]:
data = pd.read_sql_query(sql,conn)

In [ ]:
data

In [ ]:
data['Sex'] = [1 if x == 'female' else 0 for x in data['Sex']]

In [ ]:
data

In [ ]:
M = data.loc[:, ['Survived','Age','SibSp','Parch','Fare','Sex']]

In [ ]:
M

In [ ]:
M.corr()

In [ ]:
import matplotlib.pyplot as plt 
import seaborn as sns

In [ ]:
plt.figure(figsize=(15,15))
sns.heatmap(data = M.corr(), annot=True, 
fmt = '.2f', linewidths=.5, cmap='Blues')
plt.show()

In [ ]:
from matplotlib import font_manager, rc
font_path = "data/THEdog.ttf"   #폰트파일의 위치
font_name = font_manager.FontProperties(fname=font_path).get_name()
rc('font', family=font_name)

In [ ]:
plt.figure(figsize=(15,15))
data1=data[data['Survived'] == 1]
ax=sns.countplot(x='Sex',data=data1)
ax.set_title("타이타닉호의 성별 생존자 수", fontsize= 30)
ax.set_xticklabels(['남성','여성'], fontsize=15)
ax.set_xlabel('성별', fontsize= 20) 
ax.set_ylabel('생존자 수', fontsize= 20)  
plt.show()

In [ ]:
fig, ax = plt.subplots(1,2, figsize = (12, 8))

sns.kdeplot(data[data['Survived'] == 0]['Age'], ax = ax[0])
sns.kdeplot(data[data['Survived'] == 1]['Age'], ax = ax[1])
plt.show()

In [ ]:
fig, ax = plt.subplots(2,2, figsize = (12, 8))

sns.kdeplot(data[(data['Survived'] == 1) & (data['Sex'] == 0)]['Age'], ax = ax[0,0])
sns.kdeplot(data[(data['Survived'] == 0) & (data['Sex'] == 0)]['Age'], ax = ax[0,1])
sns.kdeplot(data[(data['Survived'] == 1) & (data['Sex'] == 1)]['Age'], ax = ax[1,0])
sns.kdeplot(data[(data['Survived'] == 0) & (data['Sex'] == 1)]['Age'], ax = ax[1,1])
ax[0,0].set_title("여성의 나이별 생존자")
ax[0,1].set_title("여성의 나이별 사망자")
ax[1,0].set_title("남성의 나이별 생존자")
ax[1,1].set_title("남성의 나이별 사망자")
plt.show()

In [ ]:
sql = 'SELECT Sex, count(*) cnt FROM dataset4 where Survived = 1.0 group by Sex'
data = pd.read_sql_query(sql,conn)
data

In [ ]:
plt.figure(figsize=(15,15))
ax=sns.barplot(data=data, x="Sex", y= "cnt")
ax.set_title("타이타닉호의 성별 생존자 수", fontsize= 30)
ax.set_xticklabels(['여성','남성'], fontsize=15)
ax.set_xlabel('성별', fontsize= 20) 
ax.set_ylabel('생존자 수', fontsize= 20)  
plt.show()

In [ ]:
conn = pymysql.connect(host='multi-bigdata.cljkqcsbb9ok.ap-northeast-2.rds.amazonaws.com',port=3306,user='edu12',passwd='edu12', db='edudb')

cur = conn.cursor()
sql = 'SELECT * FROM dataset4'
cur.execute(sql)
result = cur.fetchone()
print(result)